#include <iostream>//бібліотека на ввід та вивід 
using namespace std;//використовує простір імен std
#define size 4//визначає символічну константу зі значенням 5

int main() {

    int sum = 0;//задаємо змінну типу int
    int arr[size];// Оголошення статичного масиву цілих чисел розміром size
    int* ptr = arr; // Покажчик на початок масиву


    cout << "Enter 4 elements: ";//вивід повідомлення 
    for (int i = 0; i < size; ++i) {//цикл на введення чисел в масив
        cin >> *(ptr + i); // Зчитування елементу за допомогою покажчика
    }

    for (int i = 0; i < size; ++i) {// Обчислення суми елементів за допомогою покажчика
        sum = sum + *(arr + i);/// Обчислення суми елементів за допомогою покажчика
    }

    double average = sum / size;// Обчислення середнього значення

    cout << "Average value of the array: " << average << endl;   // Виведення результату

    return 0;//логічний кінець 
}






